# Classification Exercises

### 1. In a jupyter notebook, classification_exercises.ipynb, use a python module (pydata or seaborn datasets) containing datasets as a source from the iris data. Create a pandas dataframe, df_iris, from this data.

- print the first 3 rows
- print the number of rows and columns (shape)
- print the column names
- print the data type of each column
- print the summary statistics for each of the numeric variables. 
    
   Would you recommend rescaling the data based on these statistics?

In [ ]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [ ]:
df_iris = sns.load_dataset('iris')

In [ ]:
type(df_iris)

In [ ]:
#print the first 3 rows
df_iris.head(3)

In [ ]:
#print the number of rows and columns (shape)
df_iris.shape

In [ ]:
#print the column names
df_iris.columns

In [ ]:
#print the data type of each column
df_iris.dtypes

In [ ]:
#print the summary statistics for each of the numeric variables.
df_iris.describe()

### Would you recommend rescaling the data based on these statistics?

### -Yes

### 2. Read the Table1_CustDetails table from the Excel_Exercises.xlsx file into a dataframe named df_excel.

- assign the first 100 rows to a new dataframe, df_excel_sample
- print the number of rows of your original dataframe
- print the first 5 column names
- print the column names that have a data type of object
- compute the range for each of the numeric variables.

In [ ]:
 df_excel = pd.read_excel('Table1_CustDetails.xlsx', sheet_name='Table1_CustDetails')

In [ ]:
 df_excel.head()

In [ ]:
df_excel.shape

In [ ]:
df_excel_sample = df_excel.head(100)

In [ ]:
df_excel_sample.shape

In [ ]:
df_excel_sample.columns[0:5]

In [ ]:
df_excel_sample.dtypes

In [ ]:
numerics = df_excel_sample.select_dtypes(include=['float64', 'int64'])

In [ ]:
numerics.max() - numerics.min()

In [ ]:
df_cols_object_type_bool = df_excel_sample.dtypes == 'object'
df_cols_object_type_bool

In [ ]:
object_type_cols = df_excel_sample.dtypes[df_cols_object_type_bool]
object_type_cols

In [ ]:
range_monthly_charges = df_excel.monthly_charges.max() - df_excel.monthly_charges.min()
range_monthly_charges

In [ ]:
range_total_charges = df_excel.total_charges.max() - df_excel.total_charges.min()
range_total_charges

In [ ]:
range_avg_monthly_charges = df_excel.avg_monthly_charge.max() - df_excel.avg_monthly_charge.min()
range_avg_monthly_charges

In [ ]:
range_tenure = df_excel.tenure.max() - df_excel.tenure.min()
range_tenure

In [ ]:
url = "https://gist.githubusercontent.com/ryanorsinger/3fce5a65b5fb8ab728af5192c7de857e/raw/a0422b7b73749842611742a1064e99088a47917d/clean_telco.csv"
df_excel = pd.read_csv(url, index_col="id")

# 3. Read the data from this google sheet into a dataframe, df_google

- print the first 3 rows
- print the number of rows and columns
- print the column names
- print the data type of each column
- print the summary statistics for each of the numeric variables
- print the unique values for each of your categorical variables

In [ ]:
sheet_url = "https://docs.google.com/spreadsheets/d/1Uhtml8KY19LILuZsrDtlsHHDC9wuDGUSe8LTEwvdI5g/edit?usp=sharing"

csv_export_url = sheet_url.replace('/edit?usp=sharing', '/export?format=csv')

df_google = pd.read_csv(csv_export_url)
df_google.head(3)

In [ ]:
df_google.shape

In [ ]:
df_google.columns.tolist()

In [ ]:
df_google.dtypes

In [ ]:
df_google.describe().T

In [ ]:
#print the unique values for each of your categorical variables

for column in df_google.select_dtypes(include = 'object').columns:
        print(f"Values in the {column} column:")
        print(df_google[column].value_counts())
        print('----')
        print ()

In [ ]:
df_google.Survived.unique()

In [ ]:
df_google.Pclass.unique()

In [ ]:
df_google.Sex.unique()

In [ ]:
df_google.SibSp.unique()

In [ ]:
df_google.Parch.unique()

In [ ]:
df_google.Cabin.unique()

In [ ]:
df_google.Embarked.unique()

In [ ]:
def get_db_url(host, user, password, database):
        
    url = f'mysql+pymysql://{user}:{password}@{host}/{database}'
    
    return url

def get_titanic_data():
    from env import host, user, password

    database = 'titanic_db'

    query = "SELECT * FROM passengers;"

    df = pd.read_sql(query, get_db_url(host,user, password, 'titanic_db'))

    return df

In [ ]:
df = get_titanic_data()

In [ ]:
df

In [ ]:
def get_iris_data():
    from env import host, user, password
       
    database = 'iris_db'

    query = "SELECT * FROM species;"

    df = pd.read_sql(query, get_db_url(host,user, password, 'iris_db'))

    return df

In [ ]:
df_iris = get_iris_data()
df_iris

# Data Preparation Exercises

### 1. Use the function defined in acquire.py to load the iris data.

In [1]:
import pandas as pd
import acquire 

df_iris = acquire.get_iris_data()
df_iris

,Unnamed: 0,measurement_id,species_id,species_name,sepal_length,sepal_width,petal_length,petal_width
0,0,1,1,setosa,5.1,3.5,1.4,0.2
1,1,2,1,setosa,4.9,3.0,1.4,0.2
2,2,3,1,setosa,4.7,3.2,1.3,0.2
3,3,4,1,setosa,4.6,3.1,1.5,0.2
4,4,5,1,setosa,5.0,3.6,1.4,0.2
...,...,...,...,...,...,...,...,...
145,145,146,3,virginica,6.7,3.0,5.2,2.3
146,146,147,3,virginica,6.3,2.5,5.0,1.9
147,147,148,3,virginica,6.5,3.0,5.2,2.0
148,148,149,3,virginica,6.2,3.4,5.4,2.3
149,149,150,3,virginica,5.9,3.0,5.1,1.8

### 2. Drop the species_id and measurement_id columns.

In [2]:
df_iris = df_iris.drop(columns = ['species_id', 'measurement_id', 'Unnamed: 0'])

In [3]:
df_iris

    species_name  sepal_length  sepal_width  petal_length  petal_width
0         setosa           5.1          3.5           1.4          0.2
1         setosa           4.9          3.0           1.4          0.2
2         setosa           4.7          3.2           1.3          0.2
3         setosa           4.6          3.1           1.5          0.2
4         setosa           5.0          3.6           1.4          0.2
..           ...           ...          ...           ...          ...
145    virginica           6.7          3.0           5.2          2.3
146    virginica           6.3          2.5           5.0          1.9
147    virginica           6.5          3.0           5.2          2.0
148    virginica           6.2          3.4           5.4          2.3
149    virginica           5.9          3.0           5.1          1.8

[150 rows x 5 columns]

### 3. Rename the species_name column to just species.

In [4]:
df_iris = df_iris.rename(columns={"species_name": "species"})

In [5]:
df_iris

       species  sepal_length  sepal_width  petal_length  petal_width
0       setosa           5.1          3.5           1.4          0.2
1       setosa           4.9          3.0           1.4          0.2
2       setosa           4.7          3.2           1.3          0.2
3       setosa           4.6          3.1           1.5          0.2
4       setosa           5.0          3.6           1.4          0.2
..         ...           ...          ...           ...          ...
145  virginica           6.7          3.0           5.2          2.3
146  virginica           6.3          2.5           5.0          1.9
147  virginica           6.5          3.0           5.2          2.0
148  virginica           6.2          3.4           5.4          2.3
149  virginica           5.9          3.0           5.1          1.8

[150 rows x 5 columns]

### 4. Create dummy variables of the species name.

In [6]:
df_dummy = pd.get_dummies(df_iris[['species']])
df_iris = pd.concat([df_iris, df_dummy], axis = 1)
df_iris.head()

,species,sepal_length,sepal_width,petal_length,petal_width,species_setosa,species_versicolor,species_virginica
0,setosa,5.1,3.5,1.4,0.2,1,0,0
1,setosa,4.9,3.0,1.4,0.2,1,0,0
2,setosa,4.7,3.2,1.3,0.2,1,0,0
3,setosa,4.6,3.1,1.5,0.2,1,0,0
4,setosa,5.0,3.6,1.4,0.2,1,0,0

### 5. Create a function named prep_iris that accepts the untransformed iris data, and returns the data with the transformations above applied.

In [ ]:
def prep_iris(df):
    
    import pandas as pd
    import acquire 

    df_iris = acquire.get_iris_data()
    
    df_iris = df_iris.drop(columns = ['species_id', 'measurement_id', 'Unnamed: 0'])
    
    df_iris = df_iris.rename(columns={"species_name": "species"})
    
    df_dummy = pd.get_dummies(df_iris[['species']])
    
    return pd.concat([df_iris, df_dummy], axis = 1)

In [7]:
import prepare

In [8]:
prepare.prep_iris()

,species,sepal_length,sepal_width,petal_length,petal_width,species_setosa,species_versicolor,species_virginica
0,setosa,5.1,3.5,1.4,0.2,1,0,0
1,setosa,4.9,3.0,1.4,0.2,1,0,0
2,setosa,4.7,3.2,1.3,0.2,1,0,0
3,setosa,4.6,3.1,1.5,0.2,1,0,0
4,setosa,5.0,3.6,1.4,0.2,1,0,0
...,...,...,...,...,...,...,...,...
145,virginica,6.7,3.0,5.2,2.3,0,0,1
146,virginica,6.3,2.5,5.0,1.9,0,0,1
147,virginica,6.5,3.0,5.2,2.0,0,0,1
148,virginica,6.2,3.4,5.4,2.3,0,0,1
149,virginica,5.9,3.0,5.1,1.8,0,0,1

# Imputing Data

In [3]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

from sklearn.model_selection import train_test_split
from sklearn.impute import SimpleImputer

import warnings
warnings.filterwarnings("ignore")

import acquire

In [4]:
df = acquire.get_titanic_data()

In [5]:
# rows & columns
df.shape

(891, 14)

In [6]:
# first n rows
df.head()

,Unnamed: 0,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
0,0,0,0,3,male,22.0,1,0,7.2500,S,Third,NaN,Southampton,0
1,1,1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0
2,2,2,1,3,female,26.0,0,0,7.9250,S,Third,NaN,Southampton,1
3,3,3,1,1,female,35.0,1,0,53.1000,S,First,C,Southampton,0
4,4,4,0,3,male,35.0,0,0,8.0500,S,Third,NaN,Southampton,1

In [7]:
def split_titanic_data(df):
    """
    splits the data in train validate and test 
    """
    train, test = train_test_split(df, test_size = 0.2, random_state = 123, stratify = df.survived)
    
    #Splitting again but this time passing in train to split up
    train, validate = train_test_split(train, test_size=.25, random_state=123, stratify=train.survived)
    
    return train, validate, test

In [13]:
train, validate, test = split_titanic_data(df)

In [14]:
# Define the thing:

imputer = SimpleImputer(strategy ='most_frequent')
imputer

SimpleImputer(strategy='most_frequent')

In [15]:
# fit the thing on train, not validate and test, because that would be training your model on future data

imputer = imputer.fit(train[['embark_town']])
imputer

SimpleImputer(strategy='most_frequent')

In [16]:
# Use the thing (i.e transform)

train[['embark_town']] = imputer.transform(train[['embark_town']])

validate[['embark_town']] = imputer.transform(validate[['embark_town']])

test[['embark_town']] = imputer.transform(test[['embark_town']])